import time

a1 = "1 Поговоримо про погоду"
a2 = "2 Поговоримо про фільми"
a3 = "3 Поговоримо про книги"
a4 = "4 Поговоримо про ігри"
a5 = "5 Пограємось з числами"
a6 = "6 Я хочу завершити діалог"
a7 = "6 Я поки що не хочу говорити"
end = "Ну що ж, тоді бувай. Гарного відпочинку ;)"

print("Привіт, я чат бот Анна. З чого почнем?")
time.sleep(1.5)
print(a1)
print(a2)
print(a3)
print(a4)
print(a5)
print(a7)
q1 = int(input("Вибери 1, 2, 3, 4, 5 чи 6"))

while True:
    if q1 == 1:
        temp = input("Яка зараз погода на вулиці?")
        if temp == "тепло" or temp == "жарко" or temp == "сонячно" or temp == "сухо" :
            print("Коли будеш виходити на вулицю - обов`язково візьми з собою воду")
        elif temp == "холодно" or temp == "вітер" or temp == "сніг" or temp == "мороз":
            print("Краще вдягайся тепліше, щоб не змерзнути")
        input("Хмм... А якби ти міг керувати погодою, яка б погода зараз була?")
        input("А чому саме ця? Це твоя улюблена?")
        print("Прикольно :)")

        print("Говоримо далі?")
        talk = input("Вибери варіант так або ні")
        if talk == "ні":
            print(end)
            break
        elif talk == "так":
            print(a1)
            print(a2)
            print(a3)
            print(a4)
            print(a5)
            print(a6)
            q1 = int(input("Вибери 1,2,3,4,5 або 6"))
            continue

    elif q1 == 2:
        print("Які жанри фільмів тобі подобаються?")
        print("1 жахи")
        print("2 фентезі")
        print("3 драми/мелодрами")
        print("4 бойовики")
        print("5 комедії")
        film = int(input("Вибери 1,2,3,4 чи 5"))
        o1 = "Я знаю декілька фільмів які тобі можуть сподобатись:"
        o2 = "Доречі, ці всі фільми вийшли в 2020р. Приємного перегляду :)"
        print(o1)
        if film == 1:
            print("• Під водою")
            print("• Гензель і Греттель")
            print("• Людина-невидимка")
            print("• Острів Фантазій")
            print("• Полювання")
        elif film == 2:
            print("• Відьми")
            print("• Дулітл")
            print("• Їжак Сонік")
            print("• Дивожінка 1984")
            print("• Ключ часу")
        elif film == 3:
            print("• Хімічні серця")
            print("• Аду")
            print("• Емма")
            print("• Енола Холмс")
            print("• 37 секунд")
        elif film == 4:
            print("• Полювання")
            print("• Евакуація")
            print("• Наші Котики")
            print("• Хижі пташки")
            print("• Правосуддя Спенсера")
        elif film == 5:
            print("• Дулітл")
            print("• Їжак Сонік")
            print("• Наші Котики")
            print("• Побачення у Вегасі")
            print("• Зенго")
        time.sleep(4)
        print(o2)
        time.sleep(1.5)
        input("Цікво, а якби ти був(була) режисером(-кою) фільму, який фільм ти б зняв(-ла) і в якому жанрі?")
        print("Цікава ідея! Думаю, в майбутньму ти зможеш зняти такий фільм! Головне - не забудь про нього ;)")
        time.sleep(3)
        films = int(input("А скільки фільмів ти бачив(-ла)? Якщо не пам`ятаєш точно, напиши скільки приблизно"))
        if 0 < films <= 10:
            print("Ти ще новачок) Тобі доведеться ще багато що дізнатись про фільми")
        elif 10 < films <= 20:
            print("Класно) Продовжуй в тому ж дусі)")
        elif 20 < films <= 50:
            print("Ого! Це достатньо багато")
        elif 50 < films <= 100:
            print("Нічого собі! Ти 100% кіноман!")
        elif films > 100:
            print("НІЧОГО СОБІ!!! Просто без коментарів...")
        time.sleep(1.2)
        print("Ну що ж, продовжуємо нашу розмову?")
        talk = input("Вибери варіант так або ні")
        if talk == "ні":
            print(end)
            break
        elif talk == "так":
            print(a1)
            print(a2)
            print(a3)
            print(a4)
            print(a5)
            print(a6)
            q1 = int(input("Вибери 1,2,3,4,5 або 6"))
            continue

    elif q1 == 3:
        print("Які жанри книг тобі подобаються?")
        print("1 детективи")
        print("2 науково-фантастичні")
        print("3 романи")
        print("4 пригодницькі")
        print("5 біографічні/автобіографічні")
        book = int(input("Вибери 1,2,3,4 чи 5"))
        o1 = "Я знаю декілька книг які тобі можуть сподобатись:"
        o2 = "Доречі, ці всі книги вийшли в 2019-2020рр. Приємного читання :)"
        print(o1)
        if book == 1:
            print("• Дівчата, які нічого не скажуть")
            print("• Йди туди, де страшно")
            print("• 1793")
            print("• Дім тіней")
            print("• Полювання")
        elif book == 2:
            print("• Сторожова застава")
            print("• Робін Гобб - учень вбивці")
            print("• Крах імперії")
            print("• Бартімеус")
            print("• Чародільський град")
        elif book == 3:
            print("• Тисяча поцілунків, які неможливо забути")
            print("• Людина, яка хотіла бути щасливою")
            print("• День, що навчив мене жити")
            print("• Дівчина та ніч")
            print("• Провина зірок")
        elif book == 4:
            print(o1)
            print("• Дарителі")
            print("• Боятись, але робити")
            print("• Ґедвіг")
            print("• Локвуд і Ко")
            print("• Важкий понеділок")
        elif book == 5:
            print("• Щоденник книгаря")
            print("• Не така, як всі")
            print("• Переможець завжди самотній")
            print("• Шлях до характеру")
            print("• Дім, в якому...")
            time.sleep(4)
        print(o2)
        time.sleep(1.5)
        input("Цікво, а якби ти був(-ла) письменником(-цею), яку нкигу ти б написав(-ла) і в якому жанрі?")
        print("Цікава ідея! Думаю, в майбутньму ти зможеш це реалізувати! Головне - не забудь про неї ;)")
        time.sleep(3)
        books = int(input("А скільки книг ти прочитав(-ла)? Якщо не пам`ятаєш точно, напиши скільки приблизно"))
        if 0 < books <= 5:
            print("Ти ще новачок) Тобі доведеться ще багато що дізнатись про книги")
        elif 5 < books <= 20:
            print("Ого! Це достатньо багато")
        elif 20 < books <= 50:
            print("Нічого собі!")
        elif books > 50:
            print("НІЧОГО СОБІ!!! Просто без коментарів...")
        time.sleep(1.2)

        print("Ну що ж, продовжуємо нашу розмову?")
        talk = input("Вибери варіант так або ні")
        if talk == "так":
            print(a1)
            print(a2)
            print(a3)
            print(a4)
            print(a5)
            print(a6)
            q1 = int(input("Вибери 1,2,3,4,5 або 6"))
            continue
        elif talk == "ні":
            print(end)
            break

    elif q1 == 4:
        game = input("Яка твоя улюблена відео-гра?")

        if game == "змійка":
            print("О, я знаю цю гру")
            time.sleep(1.5)
            print("Ця гра ще досі популярна, навіть через декільк десятків років посля її створення!")
            time.sleep(3)
            print("Доречі, її створили в 1997 році! Їй вже цілих 23 роки!")
            time.sleep(2)
            zmiyka = input("Хотів би зараз пограти в неї?")
            if zmiyka == "так" or zmiyka == "Так" or zmiyka == "да" or zmiyka == "Да":
                print("Ну тоді копіюй посилання в гугл і насолоджуйся!")
                print("https://www.google.com/fbx?fbx=snake_arcade")
            else:
                print("Oк")

        elif game == "pubg" or game == "Apex Legends" or game == "Fortnite":
            input("Класно! Часто в неї граєш?")
            lvl = int(input("Зрозуміло. А який в тебе рівень?"))
            if 0 < lvl <= 10:
                print("Скоріше всьго ти ще новачок, бажаю тобі успіху")
            elif 10 < lvl <= 20:
                print("Класно! Продовжуй в тому ж дусі")
            elif 20 < lvl <= 50:
                print("Це достатньо багато!")
            elif 50 < lvl <= 100:
                print("Нічого собі!")
                time.sleep(2)
                print("Це багато, але я знаю що ти зможеш ще краще!")
            elif lvl > 100:
                print("Навіть не уявлю, як довго ти до цього йшов(-ла)...")

        elif game == "тетріс":
            print("Справді?")
            time.sleep(1.5)
            print("Доречі, ти знав(-ла) що по Тетрісу проводять не тільки змагання, а й цілі світові чемпіонати!")
            time.sleep(4)
            print("Останній такий був проведений в 2019 році")
            time.sleep(3)
            print("Нажаль, через COVID-19 цього рокі чемпіонат буде он-лайн")
        print("Говоримо далі?")
        talk = input("Вибери варіант так або ні")
        if talk == "ні":
            print(end)
            break
        elif talk == "так":
            print(a1)
            print(a2)
            print(a3)
            print(a4)
            print(a5)
            print(a6)
            q1 = int(input("Вибери 1,2,3,4,5 або 6"))
            continue

    elif q1 == 5:
        print("Ну що ж, зараз я покажу тобі фокус")
        time.sleep(0.5)
        print("Загадай будь-яке число")
        time.sleep(5)
        print("Помнож його на 8")
        time.sleep(4)
        print("Відніми 20")
        time.sleep(4)
        print("Розділи результат на 4")
        time.sleep(5)
        n1 = int(input("Введи, що в тебе вийшло"))
        n1 = n1 + 5
        n1 = n1 / 2
        print("І твоє число це:", n1)
        time.sleep(3)
        print("Хочеш ще фокусів?")
        more = input("Вибери варіант так або ні")
        if more == "так":
            print("Загадай будь яке число")
            time.sleep(2)
            print("Тепер додай до цього числа попереднє і наступне число, або, як їх ще називають - сусідні")
            time.sleep(4)
            n2 = int(input("Введи, що в тебе вийшло"))
            n2 = n2 / 3
            print("І ти загадав:", n2)
            time.sleep(2)
            print("Поки що, мій творець навчив мене лише цьому, але я сподіваюсь, я навчусь ще багато чому цікавому")
        else:
            print("Говоримо далі?")
            talk = input("Вибери варіант так або ні")
            if talk == "ні":
                print(end)
                break
            elif talk == "так":
                print(a1)
                print(a2)
                print(a3)
                print(a4)
                print(a5)
                print(a6)
                q1 = int(input("Вибери 1,2,3,4 чи 5"))
                continue
        print("Говоримо далі?")
        talk = input("Вибери варіант так або ні")
        if talk == "ні":
            print(end)
            break
        elif talk == "так":
            print(a1)
            print(a2)
            print(a3)
            print(a4)
            print(a5)
            print(a6)
            q1 = int(input("Вибери 1,2,3,4,5 або 6"))
            continue

    elif q1 == 6:
        print("Ти впевнений?")
        stop = input("Введи варіант так або ні")
        if stop == "так":
            print("Ну що ж, тоді бувай. Бажаю весело провести час ;)")
            break
        elif stop == "ні":
            print("Говоримо далі?")
            talk = input("Вибери варіант так або ні")
            if talk == "ні":
                print(end)
                break
            elif talk == "так":
                print(a1)
                print(a3)
                print(a4)
                print(a5)
                print(a6)
                q1 = input("Вибери 1,2,3,4,5 або 6")
                continue
    else:
        print("Будьласка, виберіть на клавіатруці цифру, відповідно до Вашого бажання")
        print(q1)
        continue
